using System.Collections;
using System.Text;
// --------------------------------------------------------------------------------------------------------------------------------------
//namespace GenericClassExample2
//{

//    class Program
//    {
//        static void AnotherContext()
//        {
//            var ar = new SortedSet<int>(); // об'єкт створюється в керованій купі
//            // нью поверне адресу, яка зберігається в ar, при тому що ar - це змінна посилального типу, яка зберігається в стеку
//            ar.Add(10);
//            ar.Add(66);
//            ar.Add(44);
//            ar.Add(15);
//            ar.Add(77);
//            ar.Add(15);
//            ar.Add(55);
//            ar.Add(99);
//            ar.Add(22);
//            foreach (var elem in ar) // тут на кожный ітерації створюється копія значення елемента колекції
//                Console.WriteLine(elem);
//        } // exit from function

//        static void Main()
//        {
//            Console.WriteLine("1111");
//            AnotherContext();
//            Console.WriteLine(ar);
//            Console.WriteLine(elem);
//            Console.WriteLine("2222");
//        }
//    }
//}
// --------------------------------------------------------------------------------------------------------------------------------------
//при виклику оператора нью для об'єкта класа, дот нет рантайм (сіелер):

//1) обчислює розмір об'єкта, враховуючи всі поля-структури, всі поля-посилання, хедер об'єкта (16Б), + вирівнювання розміру до кратності 8Б
//2) перевіряє, чи доступно стільки пам'яті в керованій купі
//3) якщо не досить пам'яті, то дот нет рантайм пробує довиділити певний обсяг пам'яті
//(вдвічі більше, або 2ГБ, або залишок пам'яті, або виліт - OutOfMemoryException - тоді процес вивантажується)
//4) якщо досить пам'яті - то підрахований обсяг байтів заповнюється нулями, спеціальне посилання nextObjRef пересувається вправо на розмір об'єкта,
//і таким чином, коли наступного разу буде викликатися оператор нью, то дот нет рантайм ВЖЕ знає, куди його покласти,
//а не шукає який рандомний шматок пам'яті як це відбувається під управлінням ОС віндовс або іншої

//в керованій купі (дот нет рантаймом) на відміну від некерованої купи (під управлінням звичайної ОС) всі об'єкти лежать ПОРУЧ
// --------------------------------------------------------------------------------------------------------------------------------------
//збірка сміття:
//1) відстеження посилань(пошук усіх статичних полів класів та структур у програмі, та пошук усіх локальних змінних посилального типу,
//локальні змінні структурного типу також перевіряються на наявність полів-посилань,
//параметри методів - вони самі по собі можуть бути посиланнями, або якщо це структури, то поля структури можуть бути посиланнями)
//2) маркування - в певному невеликому розмірі хіпа перебираються усі об'єкти,
//і їм в хедер (8Б) в певний біт пишеться число 0 - це означає, що за замовчуванням цей об'єкт недосяжний,

//потім з посилань коріння відбувається перехід на той чи інший об'єкт в керованый купі,  якщо в посиланні є адреса (тобто там не нулл),
//і тоді об'єкт на який вийшли, позначається як ДОСЯЖНИЙ (в той біт де було 0 запишеться 1),
//і одразу перебираються всі поля цього об'єкта, бо він також може посилатися на інші досяжні об'єкти,
//а вони в свою чергу - теж на якісь інші об'єкти і тд, але БЕЗ РЕКУРСИВНИХ ПОСИЛАНЬ,
//якщо об'єкт ВЖЕ було позначено як досяжний, то через нього ще раз поля не перевіряються

//3) фаза стискання - compacting phase
 
//всі досяжні об'єкти будуть переміщені збірщіком сміття ближче до початку пам'яті, так щоби всі об'єкти ЗНОВУ БУЛИ ПОРУЧ 

//4) виправлення адрес

//5) після стискання, посилання на наступний новий об'єкт в керованій купі пересувається на байт після останнього вижившого об'єкта

//є проблема:
//на фазі маркування збирачу сміття треба перебрати ВСІ ОБ₴ЄКТИ в купі!
//і якщо їх наприклад штук 10 - то це швидко, а якщо їх мільони гігів на 16, то це затягнеться - це може зайняти хвилини
 
//проблема для кінцевого користувача!
// --------------------------------------------------------------------------------------------------------------------------------------

